Revit 2024 API
AnalyticalLinkType Class
 An object that specifies the analysis properties for an AnalyticalLink element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class AnalyticalLinkType : ElementType
Visual Basic
Public Class AnalyticalLinkType _
	Inherits ElementType
Visual C++
public ref class AnalyticalLinkType : public ElementType
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.AnalyticalLinkType
See Also
AnalyticalLinkType Members
Autodesk.Revit.DB.Structure Namespace